other_files/OpenFOAM_Sample_Files/internalFlowExample/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    mesh_min_max
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    building_model
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    building_West_window
    {
        type            zeroGradient;
    }
    building_East_window
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
