other_files/OpenFOAM_Sample_Files/internalFlowExample/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

        mesh_min_max
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }

    building_model
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    building_West_window
    {
        type            fixedValue;
        value           uniform -1;
    }
    building_East_window
    {
        type            fixedValue;
        value           uniform 1;
    }

}

// ************************************************************************* //
